denote/20230114T145247--ertを読む__memo.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-13 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>ertを読む</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">ertを読む</h1>
<p>
ertは<a href="../20210508234743-emacs.html#ID-1ad8c3d5-97ba-4905-be11-e6f2626127ad">Emacs</a>組み込みのテストフレームワーク。
</p>

<div id="outline-container-org99de4f7" class="outline-2">
<h2 id="org99de4f7"><a href="#org99de4f7">Tasks</a></h2>
<div class="outline-text-2" id="text-org99de4f7">
</div>
<div id="outline-container-org965bc25" class="outline-3">
<h3 id="org965bc25"><a href="#org965bc25"><span class="todo TODO">TODO</span> shouldはどうやって検証しているか</a></h3>
<div class="outline-text-3" id="text-org965bc25">
<p>
ertで定義された関数では、shouldで検証している。名前的にertに含まれないように見えるが、ertファイルで定義されている。
</p>

<div class="org-src-container">
<pre class="src src-git-permalink">https://github.com/kd-collective/emacs/blob/30cf1f34c583d6ed16bdc5b9578370f30c95fe1b/lisp/emacs-lisp/ert.el#L378-L379
</pre>
</div>

<div class="results" id="org292ac1c">
<p>
(cl-defmacro should (form)
  &ldquo;Evaluate FORM.  If it returns nil, abort the current test as failed.
</p>

</div>

<ul class="org-ul">
<li>should
<ul class="org-ul">
<li>ert&#x2013;expand-should
<ul class="org-ul">
<li>ert&#x2013;expand-should1</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4f8ed70" class="outline-3">
<h3 id="org4f8ed70"><a href="#org4f8ed70"><span class="todo TODO">TODO</span> 失敗時の値の比較表示はどうやっているか</a></h3>
<div class="outline-text-3" id="text-org4f8ed70">
<p>
expectedとresultの値を表示して、どこがおかしいのかを表示してくれる。
</p>
</div>
</div>
<div id="outline-container-org1a71814" class="outline-3">
<h3 id="org1a71814"><a href="#org1a71814"><span class="todo TODO">TODO</span> 統計記録をどうやっているか</a></h3>
<div class="outline-text-3" id="text-org1a71814">
<p>
実行テストは選択できる。実行したテストについて、成功数や時間を表示する。
</p>
</div>
</div>
<div id="outline-container-orgad6fd41" class="outline-3">
<h3 id="orgad6fd41"><a href="#orgad6fd41"><span class="todo TODO">TODO</span> 結果バッファの表示をどうやっているか</a></h3>
<div class="outline-text-3" id="text-orgad6fd41">
<p>
テスト結果が表示される。
</p>
</div>
</div>
<div id="outline-container-org6316e1c" class="outline-3">
<h3 id="org6316e1c"><a href="#org6316e1c"><span class="todo TODO">TODO</span> <code>cl-defmacro</code> と <code>defmacro</code> の違い</a></h3>
<div class="outline-text-3" id="text-org6316e1c">
<p>
使い分けているように見えるが、何が違うのかわからない。
</p>
</div>
</div>
<div id="outline-container-orge9ae863" class="outline-3">
<h3 id="orge9ae863"><a href="#orge9ae863"><span class="todo TODO">TODO</span> run-test-at-pointを作ってみる</a></h3>
<div class="outline-text-3" id="text-orge9ae863">
<p>
リストから選ぶのが面倒なので、実行できるようにする。
</p>
</div>
</div>
</div>
<div id="outline-container-org0fa0e61" class="outline-2">
<h2 id="org0fa0e61"><a href="#org0fa0e61">Memo</a></h2>
<div class="outline-text-2" id="text-org0fa0e61">
</div>
<div id="outline-container-orga0d489d" class="outline-3">
<h3 id="orga0d489d"><a href="#orga0d489d">ertの全体像</a></h3>
<div class="outline-text-3" id="text-orga0d489d">
<p>
テストフレームワークの全体像をソースコードから把握する。
</p>

<ul class="org-ul">
<li>テスト定義</li>
<li>マッチャ関数</li>
<li>テスト実行</li>
<li>エラー時の値表示</li>
<li>テストセレクタ</li>
<li>テストのサマリー表示
<ul class="org-ul">
<li>成功数</li>
<li>失敗数</li>
<li>開始時間</li>
</ul></li>
<li>バッチ実行</li>
<li>JUnit形式出力</li>
<li>実行テスト登録・削除</li>
<li>プログレスバー</li>
<li>モードライン表示</li>
<li>成功時・失敗時のface設定</li>
<li><code>ert-results-mode</code> の各種機能・キーバインド</li>
</ul>
</div>
</div>

<div id="outline-container-org05bfd6c" class="outline-3">
<h3 id="org05bfd6c"><a href="#org05bfd6c">デバッグ情報を定義する</a></h3>
<div class="outline-text-3" id="text-org05bfd6c">
<p>
defmacroにメタ情報を定義するときは、declareを使う。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>デバッグ情報の定義</label><pre class="src src-git-permalink">https://github.com/kd-collective/emacs/blob/30cf1f34c583d6ed16bdc5b9578370f30c95fe1b/lisp/emacs-lisp/ert.el#L215-L217
</pre>
</div>

<div class="results" id="org036dcab">
<p>
(declare (debug (&amp;define [&amp;name &ldquo;test@&rdquo; symbolp]
			 sexp [&amp;optional stringp]
			 [&amp;rest keywordp sexp] def-body))
</p>

</div>
</div>
</div>
<div id="outline-container-org5f421dd" class="outline-3">
<h3 id="org5f421dd"><a href="#org5f421dd">エラーを定義する</a></h3>
<div class="outline-text-3" id="text-org5f421dd">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>エラーを定義する</label><pre class="src src-emacs-lisp">(define-error 'my-failed <span class="org-string">"failed"</span>)
</pre>
</div>

<p>
プロパティにmy-failedを登録する。
</p>
</div>
</div>
<div id="outline-container-org4887150" class="outline-3">
<h3 id="org4887150"><a href="#org4887150">UI用の関数</a></h3>
<div class="outline-text-3" id="text-org4887150">
<ul class="org-ul">
<li>insert-text-button
<ul class="org-ul">
<li>ボタンを追加する</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org885e209" class="outline-3">
<h3 id="org885e209"><a href="#org885e209">deftestを実行するとどうなるか</a></h3>
<div class="outline-text-3" id="text-org885e209">
<ul class="org-ul">
<li>ert-deftest 構造体に必要な情報を収集
<ul class="org-ul">
<li>ert-set-test make-ert-testで作った構造体でシンボルを登録する
<ul class="org-ul">
<li>make-ert-test テスト実行に必要なスロットを用意したオブジェクトを作る。test name, body, doc, file name &#x2026;</li>
</ul></li>
</ul></li>
</ul>

<p>
ということで、テスト構造体がシンボルとして登録される、という感じか。単純。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>メインの関数</label><pre class="src src-git-permalink">https://github.com/kd-collective/emacs/blob/30cf1f34c583d6ed16bdc5b9578370f30c95fe1b/lisp/emacs-lisp/ert.el#L191
</pre>
</div>

<div class="results" id="orgfb0219f">
<p>
(cl-defmacro ert-deftest (name () &amp;body docstring-keys-and-body)
</p>

</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>テスト構造体を作る関数</label><pre class="src src-git-permalink">https://github.com/kd-collective/emacs/blob/30cf1f34c583d6ed16bdc5b9578370f30c95fe1b/lisp/emacs-lisp/ert.el#L140
</pre>
</div>

<div class="results" id="orgd6a2519">
<p>
(defun ert-set-test (symbol definition)
</p>

</div>
</div>
</div>

<div id="outline-container-org0a71714" class="outline-3">
<h3 id="org0a71714"><a href="#org0a71714">実行テストリストをどうやって表示しているか</a></h3>
<div class="outline-text-3" id="text-org0a71714">
<p>
実行できる実行の一覧から選んで実行することになる。このリストはどうやって表示しているのだろうか。
</p>

<ul class="org-ul">
<li>obarray シンボルテーブル</li>
<li>seq-filter リストをフィルタする</li>
<li>obarray の中から、ert-test に割り当てられたものをフィルタリングして、ert-deftestで定義されたテストオブジェクトを取り出している</li>
<li>取り出したリストをcompleting-readに渡して選択肢表示する</li>
</ul>
</div>
</div>

<div id="outline-container-org4a31fe9" class="outline-3">
<h3 id="org4a31fe9"><a href="#org4a31fe9">テストを実行するとき何が起きているか</a></h3>
<div class="outline-text-3" id="text-org4a31fe9">
<ul class="org-ul">
<li>ert-run-tests-interactively 実行可能なテストのリストを選択、バッファ表示、実行
<ul class="org-ul">
<li>listenerはevent-typeを受け取る無名関数</li>
<li>ert-run-tests 特定したテストを実行する
<ul class="org-ul">
<li>結果を取得し、変数most-recent-resultに保存する</li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>テスト実行関数</label><pre class="src src-git-permalink">https://github.com/kd-collective/emacs/blob/30cf1f34c583d6ed16bdc5b9578370f30c95fe1b/lisp/emacs-lisp/ert.el#L2254
</pre>
</div>

<div class="results" id="org398406d">
<p>
(defun ert-run-tests-interactively (selector)
</p>

</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>関数評価で実行するときは引数を渡す必要がある</label><pre class="src src-emacs-lisp">(ert-run-tests-interactively 'cl-remove-if-not-test)
</pre>
</div>

<ul class="org-ul">
<li>ert-run-tests-interactively
<ul class="org-ul">
<li>テストそのものというより、ユーザ入力とバッファで見せる部分が多くを占める</li>
<li>interactive関数によって、M-xで呼んだときにはcompletionの値が入る</li>
<li>この引数の名前はselectorという名前がついている</li>
<li>listerはどういう意味か。関数なのは確か
<ul class="org-ul">
<li>event-typeによって処理が変わる関数</li>
<li>run-startedのときは準備バッファを表示する</li>
<li>run-endedのとき成功してたら統計バッファを表示する</li>
<li>test-startedのとき
<ul class="org-ul">
<li>ewocって何だ
<ul class="org-ul">
<li>ewoc関係の関数は組み込みで入っている</li>
</ul></li>
</ul></li>
<li>test-endedのときは統計バッファを更新する</li>
</ul></li>
</ul></li>

<li>ert-run-tests
<ul class="org-ul">
<li>ert-run-or-rerun-test</li>
<li>ert-run-test
<ul class="org-ul">
<li>ert&#x2013;run-test-internal
<ul class="org-ul">
<li>デバッグ関連の情報を付加する</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
